function LoadAngryKeystonesUkrainizer()
	if IsAddOnLoaded("AngryKeystones") then
		local Locale = AngryKeystones:NewModule('Locale')

		local default_locale = "ukUA"
		local current_locale = GetLocale()

		local langs = {}
		langs.ukUA = {
			config_characterConfig = "Налаштування для кожного персонажа",
			config_progressTooltip = "Показувати прогрес для кожного ворога в підказках",
			config_progressFormat = "Формат відображення прогресу",
			config_progressFormat_1 = "24.19%",
			config_progressFormat_2 = "90/372",
			config_progressFormat_3 = "24.19% - 90/372",
			config_progressFormat_4 = "24.19% (75.81%)",
			config_progressFormat_5 = "90/372 (282)",
			config_progressFormat_6 = "24.19% (75.81%) - 90/372 (282)",
			config_splitsFormat = "Відстеження досягнення цілей",
			config_splitsFormat_1 = "Вимкнено",
			config_splitsFormat_2 = "Час з початку",
			config_splitsFormat_3 = "Відносно попередніх",
			config_autoGossip = "Автоматично запускати діалоги під час Епохального Ключа.",
			config_cosRumors =
			"Надсилати в груповий чат підказки від \"Розсіювача чуток\" під час проходження \"Палати Зірок\".",
			config_silverGoldTimer = "Показувати таймер для +2 і +3 бонусних скриньок одночасно",
			config_completionMessage = "Показувати повідомлення з підсумковим часом проходження Епохального Ключа.",
			config_showSplits = "Показувати різницю часу для кожної події в вікні прогресу",
			keystoneFormat = "[Ключ: %s - Рівень %d]",
			completion0 = "Ви завершили %s за %s, але вийшли за ліміт часу на %s.",
			completion1 = "Ви завершили %s за %s. Ви опередили час на %s, і не встигли для +2 на %s.",
			completion2 = "Ви завершили %s на +2 за %s. Ви опередили час на %s, і не встигли для +3 на %s.",
			completion3 = "Ви завершили %s на +3 за %s. Ви опередили час на %s.",
			completionSplits = "Різниця у часі була: %s.",
			timeLost = "Втрачений час",
			config_smallAffixes = "Зменшити значки посилення в вікні таймера",
			config_deathTracker = "Показувати трекер смертей на рамці таймера",
			scheduleTitle = "Розклад",
			scheduleWeek1 = "Цього тижня",
			scheduleWeek2 = "Наступного тижня",
			scheduleWeek3 = "Через два тижні",
			scheduleWeek4 = "Через три тижні",
			scheduleMissingKeystone = "Для відображення, потрібний ключ 7+ рівня у вашому інвентарі.",
			scheduleUnknown = "Наразі невідомий оновлений розклад афіксів.",
			config_hideTalkingHead = "Приховати діалогові вікна під час підземель Міфічного Ключа",
			config_resetPopup = "Показувати спливаюче вікно для скидання підземелля після завершення Міфічного Ключа",
			partyKeysTitle = "Ключі групи",
			newKeystoneAnnounce = "Новий Ключ: %s",
			currentKeystoneText = "Поточний: |cFFFFFFFF%s|r",
			config_announceKeystones = "Повідомляти групу про нові отримані Міфічні Ключі",
			config_schedule = "Показувати розклад ключів та ключі у групі (потрібно перезавантаження інтерфейсу)",
			["dungeon_Shadowmoon Burial Grounds"] = "Тіньове Могилище",
			["dungeon_Temple of the Jade Serpent"] = "Храм Нефритового Змія",
			timeLimit = "Обмеження часу %s",
		}

		function Locale:Get(key)
			return langs[default_locale][key]
		end

		function Locale:Local(key)
			return langs[default_locale][key]
		end

		function Locale:Exists(key)
			return langs[default_locale][key] ~= nil
		end

		setmetatable(Locale, { __index = Locale.Get })


		local clues = {}
		local rumors = {}

		clues.ukUA = {
			male = MALE,
			female = FEMALE,
			lightVest = "Легкий жилет",
			darkVest = "Темний жилет",
			shortSleeves = "Короткі рукави",
			longSleeves = "Довгі рукави",
			cloak = "Плащ",
			noCloak = "Без плаща",
			gloves = "Рукавиці",
			noGloves = "Без рукавиць",
			noPotion = "Без зілля",
			book = "Книга",
			coinpurse = "Гаманець",
			potion = "Зілля",
		}

		rumors.ukUA = {
			["Я чув десь, що шпигун не жінка."] = "male",
			["Я чув, що шпигун тут і він дуже гарний."] = "male",
			["Один з гостей сказав, що вона побачила його, коли він увійшов до особняка разом із Великою Магістрисою."] = "male",
			["Один з музикантів сказав, що він не зупиняється задавати питання про район."] = "male",

			["Хтось говорить, що наш новий гість не чоловік."] = "female",
			["Гість бачила, що вона і Елізанда прибули разом раніше."] = "female",
			["Кажуть, що шпигун тут і вона прекрасна на вид."] = "female",
			["Я чую, що якась жінка постійно задає питання про район..."] = "female",

			["Шпигун безумовно вибирає стиль жилеток світлих кольорів."] = "lightVest",
			["Я чув, що шпигун носить світлішу жилетку на сьогоднішню вечірку."] = "lightVest",
			["Люди говорять, що шпигун не носить темнішу жилетку сьогодні ввечері."] = "lightVest",

			["Шпигун безумовно вибирає темний одяг."] = "darkVest",
			["Я чув, що жилетка шпигуна сьогодні вночі темного, багатого відтінку."] = "darkVest",
			["Шпигун любить жилетки темних кольорів... як ніч."] = "darkVest",
			["Чутки говорять, що шпигун уникає світлого одягу, щоб краще злитися з навколишнім."] = "darkVest",

			["Хтось сказав мені, що шпигун не любить носити довгі рукави."] = "shortSleeves",
			["Я чув, що шпигун носить короткі рукави, щоб руки не обтяжувалися."] = "shortSleeves",
			["Я чув, що шпигун любить прохолодний повітря і сьогодні ввечері не носить довгі рукави."] = "shortSleeves",
			["Моя подруга сказала, що вона бачила наряд, в якому був шпигун. Він не мав довгих рукавів."] = "shortSleeves",

			["Я чув, що наряд шпигуна сьогодні має довгі рукави."] = "longSleeves",
			["Моя подруга згадала, що шпигун має довгі рукави."] = "longSleeves",
			["Хтось сказав, що шпигун приховує свої руки довгими рукавами сьогодні ввечері."] = "longSleeves",
			["Я ледь помітив довгі рукави шпигуна раніше ввечері."] = "longSleeves",

			["Хтось згадав, що шпигун зайшов раніше, носивши плащ."] = "cloak",
			["Я чув, що шпигун любить носити плащі."] = "cloak",

			["Я чув, що шпигун залишив свій плащ у палаці, перш ніж прийти сюди."] = "noCloak",
			["Я чув, що шпигун не терпить плащів і відмовляється носити їх."] = "noCloak",

			["Ходять чутки, що шпигун завжди носить рукавички."] = "gloves",
			["Я чув, що шпигун ретельно приховує свої руки."] = "gloves",
			["Хтось сказав, що шпигун носить рукавички, щоб приховати очевидні шрами."] = "gloves",
			["Я чув, що шпигун завжди надягає рукавички."] = "gloves",

			["Ти знаєш... Я знайшов запасну пару рукавичок у задній кімнаті. Шпигун, ймовірно, десь тут без рукавичок."] = "noGloves",
			["Є чутки, що у шпигуна ніколи немає рукавичок на руках."] = "noGloves",
			["Я чув, що шпигун уникає носити рукавички, в разі потреби швидких дій."] = "noGloves",
			["Я чув, що шпигун не любить носити рукавички."] = "noGloves",

			["Чутки кажуть, що шпигун обожнює читати і завжди носить з собою щонайменше одну книгу."] = "book",
			["Я чув, що у шпигуна завжди є книга з написаними таємницями на поясі."] = "book",

			["Музикантка сказала мені, що вона бачила, як шпигун викинув своє останнє зілля і більше не має його."] = "noPotion",
			["Я чув, що у шпигуна немає при собі зілля."] = "noPotion",

			["Я впевнений, що у шпигуна є зілля на поясі."] = "potion",
			["Я чув, що шпигун прихопив з собою зілля, цікаво, чому?"] = "potion",
			["Я чув, що шпигун прихопив з собою деякі зілля... на всякий випадок."] = "potion",
			["Я не говорив цього... але шпигун маскується під алхіміка і носить зілля на поясі."] = "potion",

			["Я чув, що насічки на поясі шпигуна оздоблені вишуканою вишивкою."] = "coinpurse",
			["Подруга сказала, що шпигун обожнює золото і має поясну сумку, наповнену ним."] = "coinpurse",
			["Я чув, що насічки на поясі шпигуна наповнені золотом, щоб показати розкіш."] = "coinpurse",
			["Я чув, що шпигун завжди носить магічну сумку при собі."] = "coinpurse",
		}

		function Locale:HasRumors()
			return rumors[current_locale] ~= nil and clues[current_locale] ~= nil
		end

		function Locale:Rumor(gossip)
			if rumors[default_locale] and rumors[default_locale][gossip] then
				return clues[default_locale] and clues[default_locale][rumors[default_locale][gossip]]
			end
		end
	else
		-- Модуль AngryKeystones не завантажений, виконайте відповідні дії або повідомлення
		print("[AddonTranslator]: Модуль AngryKeystones не завантажений")
	end
end
