function LoadScrapUkrainizer()
  if IsAddOnLoaded("Scrap") then
    local L = LibStub("AceLocale-3.0"):GetLocale("Scrap")

    L.FONTS = {
      NORMAL = "Interface\\AddOns\\AddonTranslator\\assets\\Arsenal_Regular.ttf",
      BOLD = "Interface\\AddOns\\AddonTranslator\\assets\\Arsenal_Bold.ttf",
      ITALIC = "Interface\\AddOns\\AddonTranslator\\assets\\Arsenal_Italic.ttf",
      HEADER = "Interface\\AddOns\\AddonTranslator\\assets\\Arsenal_Regular.ttf",
    }

    if not L then return end

    -- main
    L.Add = 'Додати до списку сміття'
    L.DestroyCheapest = 'Знищувати найдешевші предмети'
    L.DestroyJunk = 'Знищити всі сміттєві предмети'
    L.Junk = 'Сміття'
    L.NotJunk = 'Не сміття'
    L.SellJunk = 'Продати сміття'
    L.Remove = 'Встановити як корисне'
    L.ToggleMousehover = 'Перемикання предмету під курсором'

    -- chat
    L.Added = 'Додано до списку сміття: %s'
    L.Destroyed = 'Ви знищили: %s x %s'
    L.SoldJunk = 'Ви продали сміття за %s'
    L.Repaired = 'Ви відремонтували свою броню за %s'
    L.Removed = 'Видалено зі списку сміття: %s'

    -- dialogs
    L.ConfirmDelete = 'Ви впевнені, що хочете знищити все сміття? Цю дію не можна буде скасувати.'

    -- options
    L.CharSpecific = 'Список сміття для поточного персонажа'
    L.Description = 'Докладні налаштування Scrap. Сміття не пройде!'

    L.AutoSell = 'Автоматичний продаж'
    L.AutoSellTip = 'Якщо увімкнено, Scrap автоматично продаватиме сміття, коли ви відвідуєте торговця.'
    L.AutoRepair = 'Автоматичний ремонт'
    L.AutoRepairTip = 'Якщо увімкнено, Scrap автоматично ремонтуватиме броню, коли ви відвідуєте торговця.'
    L.DestroyWorthless = 'Знищити безцінне сміття'
    L.DestroyWorthlessTip = 'Якщо увімкнено, Scrap знищить предмети сміття без вартості продажу.'
    L.GuildRepair = 'Ремонт за рахунок гільдії'
    L.GuildRepairTip =
    'Якщо увімкнено, Scrap буде використовувати кошти гільдії для ремонту перед вашими власними коштами.'
    L.Glow = 'Підсвічувати рамки з сміттям'
    L.GlowTip = 'Якщо увімкнено, Scrap буде підсвічувати рамки предметів з сміттям |cffBBBBBBСІРИМ|r кольором.'
    L.Icons = 'Іконка монетки'
    L.IconsTip = 'Якщо увімкнено, Scrap буде позначати сміття маленькими золотими монетками.'
    L.SellPrices = 'Ціни в спливаючих підказках'
    L.SellPricesTip =
    'Якщо увімкнено, ціни продажу предметів будуть показуватися в спливаючих підказках, навіть коли ви не біля торговця.'
    L.Learning = 'Інтелектуальне навчання'
    L.LearningTip =
    'Якщо увімкнено, Scrap буде відстежувати, які предмети ви часто продаєте торговцю і автоматично вважати їх сміттям.'
    L.LowConsume = 'Продавати низькорівневі споживчі товари'
    L.LowConsumeTip = 'Якщо увімкнено, Scrap буде продавати |cffff2020ВСІ|r низькорівневі споживчі товари.'
    L.LowEquip = 'Продавати низькорівневе спорядження'
    L.LowEquipTip =
    'Якщо увімкнено, Scrap буде продавати |cffff2020все|r прив\'язане спорядження, рівень якого набагато менший, ніж те, що ви маєте на собі.'
    L.SafeMode = 'Безпечний режим'
    L.SafeModeTip =
    'Якщо увімкнено, Scrap не буде продавати більше 12 предметів одночасно, тим самим зберігаючи можливість викупу.'
    L.Unusable = 'Продавати непридатне спорядження'
    L.UnusableTip =
    'Якщо увімкнено, Scrap буде продавати |cffff2020ВСЕ|r прив\'язане спорядження, яке ваш персонаж ніколи не зможе надіти.'

    -- tutorials
    L.Tutorial_Welcome =
    'Ласкаво просимо до |cffffd200Scrap|r, від |cffffd200Jaliborc|r. Це короткий посібник допоможе вам позбутися сміття.|n|nЦе зекономить ваш час і місце в сумці. Ви готові розпочати?'
    L.Tutorial_Button =
    'Scrap буде автоматично продавати всі ваші сміття кожного разу, коли ви відвідуєте торговця. Ви також можете вручну продати його: просто |cffffd200ЛКМ|r по кнопці Scrap.|n|n|cffffd200ПКМ|r по кнопці, щоб викликати додаткові опції.'
    L.Tutorial_Drag =
    'Що робити, якщо ви хочете повідомити Scrap, що продавати предмет чи ні? Просто |cffffd200Перетягніть|r його з вашої сумки на кнопку Scrap.|n|nВ якості альтернативи, ви можете |cffffd200Призначити клавішу|r в налаштуваннях |cffffd200Головного меню|r гри. Натисніть її, наводячи на предмет.'
    L.Tutorial_Visualizer =
    'Щоб побачити, які предмети ви вказали як сміття, відкрийте вкладку |cffffd200Scrap Visualizer|r.|n|nЗверніть увагу, що будуть відображатися тільки ті предмети, які були |cffffd200додані вами|r, а не всі предмети в грі.'
    L.Tutorial_Bye = 'Гарної вам подорожі, Нехай буде з вами |cffb400ffЕпік|r. Сміття не пройде!'

    -- other
    L.AdvancedOptions = 'Розширені налаштування'
    L.DeleteJunk = 'Знищити сміття'
    L.MissingOptions = '\'Scrap Options\' не завантажилися, оскільки додаток %s.'
    L.ToggleJunk = 'Встановити / зняти мітку сміття під курсором'
  else
    -- Модуль Scrap не завантажений, виконайте відповідні дії або повідомлення
    print("[AddonTranslator]: Модуль Scrap не завантажений")
  end
end
